#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eggs-projects/eggs-projects-ghost-blog/runs/run-msmm9cUxoNkkkKgP

Waiting for the plan to start...

Terraform v1.3.5
on linux_amd64
Initializing plugins and modules...
random_password.mysql_password: Refreshing state... [id=none]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b6bd2b0a093e5127]
data.aws_acm_certificate.amazon_issued: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ami.ubuntu: Reading...
aws_db_parameter_group.default: Refreshing state... [id=eggs-projects-ghost-blog-pg]
data.aws_route53_zone.zone: Reading...
aws_iam_role.ec2_role: Refreshing state... [id=eggs-projects-ghost-blog-ec2-role]
data.aws_caller_identity.current: Read complete after 0s [id=470292911211]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-072d6c9fae3253f26]
data.aws_acm_certificate.amazon_issued: Read complete after 0s [id=arn:aws:acm:us-east-1:470292911211:certificate/37ebc9c0-7003-49bf-abc5-d04a01540684]
data.aws_route53_zone.zone: Read complete after 0s [id=Z05289123I8ECO4UF5YZK]
aws_iam_role_policy_attachment.ec2_role: Refreshing state... [id=eggs-projects-ghost-blog-ec2-role-20221125165332352000000001]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=eggs-projects-ghost-blog-ec2-profile]
aws_lb_target_group.ghost_lb_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:470292911211:targetgroup/ghost-20221125174931990300000001/e2bfdaebd7198ee9]
aws_security_group.ghost_lb_sg: Refreshing state... [id=sg-0447a1e7379cc641b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0209fa9b16da5508f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03d0a2454194a2600]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06eac8d61d93f43ee]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05508181416f1f135]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0477147238a20bef2]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0bc0574691f9d9b07]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0b1a66bc867752965]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0de839dc1cf7db569]
aws_security_group.ghost_asg_sg: Refreshing state... [id=sg-0ee69ba6dd4c535a6]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0bc0574691f9d9b071080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02f9daa6cdee7043c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0005663491a9bf565]
aws_lb.ghost_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:470292911211:loadbalancer/app/eggs-projects-ghost-blog-alb/79b75629811f8af5]
aws_security_group.mysql_sg: Refreshing state... [id=sg-07bb933c9df332649]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0414dd06713986e5b]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-03a396b9bbabd6856]
aws_db_subnet_group.default: Refreshing state... [id=eggs-projects-ghost-blog-main]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=eggs-projects-ghost-blog-vpc]
aws_lb_listener.ghost_lb_listener_https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:470292911211:listener/app/eggs-projects-ghost-blog-alb/79b75629811f8af5/ee14366bc08b6728]
aws_route53_record.blog: Refreshing state... [id=Z05289123I8ECO4UF5YZK_blog.mikeeggers.com_A]
aws_lb_listener.ghost_lb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:470292911211:listener/app/eggs-projects-ghost-blog-alb/79b75629811f8af5/02efdc4040b68ca6]
aws_db_instance.default: Refreshing state... [id=terraform-20221125165339085100000002]
aws_launch_configuration.ghost_lc: Refreshing state... [id=eggs-projects-ghost-blog-lc20221126063651823500000001]
aws_autoscaling_group.ghost_asg: Refreshing state... [id=eggs-projects-ghost-blog-lc20221126063651823500000001-asg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.ghost_asg must be replaced
+/- resource "aws_autoscaling_group" "ghost_asg" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:470292911211:autoScalingGroup:9d1a3f04-5e30-4219-8461-3f8a3383fc36:autoScalingGroupName/eggs-projects-ghost-blog-lc20221126063651823500000001-asg" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - default_instance_warmup   = 0 -> null
      ~ desired_capacity          = 1 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "eggs-projects-ghost-blog-lc20221126063651823500000001-asg" -> (known after apply)
      ~ launch_configuration      = "eggs-projects-ghost-blog-lc20221126063651823500000001" -> (known after apply)
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      ~ name                      = "eggs-projects-ghost-blog-lc20221126063651823500000001-asg" -> (known after apply) # forces replacement
      + name_prefix               = (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::470292911211:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - termination_policies      = [] -> null
        # (10 unchanged attributes hidden)
    }

  # aws_launch_configuration.ghost_lc must be replaced
+/- resource "aws_launch_configuration" "ghost_lc" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:470292911211:launchConfiguration:91ac2c41-9ab6-49ea-afa5-765ee65c27bd:launchConfigurationName/eggs-projects-ghost-blog-lc20221126063651823500000001" -> (known after apply)
      ~ associate_public_ip_address      = false -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      - iam_instance_profile             = "" -> null
      ~ id                               = "eggs-projects-ghost-blog-lc20221126063651823500000001" -> (known after apply)
      ~ key_name                         = "" -> (known after apply)
      ~ name                             = "eggs-projects-ghost-blog-lc20221126063651823500000001" -> (known after apply)
      - placement_tenancy                = "" -> null
      - spot_price                       = "" -> null
      - vpc_classic_link_id              = "" -> null
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options { # forces replacement
          + http_endpoint               = "disabled" # forces replacement
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true # forces replacement
          + encrypted             = true # forces replacement
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb.ghost_alb will be updated in-place
  ~ resource "aws_lb" "ghost_alb" {
      ~ drop_invalid_header_fields       = false -> true
        id                               = "arn:aws:elasticloadbalancing:us-east-1:470292911211:loadbalancer/app/eggs-projects-ghost-blog-alb/79b75629811f8af5"
        name                             = "eggs-projects-ghost-blog-alb"
        tags                             = {
            "Name" = "eggs-projects-ghost-blog-alb"
        }
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_security_group.ghost_asg_sg will be updated in-place
  ~ resource "aws_security_group" "ghost_asg_sg" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow communication out to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0ee69ba6dd4c535a6"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Ingress rule for http to service"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0447a1e7379cc641b",
                ]
              + self             = false
              + to_port          = 80
            },
          - {
              - cidr_blocks      = []
              - description      = "Ingress rule for http"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0447a1e7379cc641b",
                ]
              - self             = false
              - to_port          = 80
            },
        ]
        name                   = "eggs-projects-ghost-blog-asg-sg"
        tags                   = {
            "Name" = "eggs-projects-ghost-blog-asg-sg"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.ghost_lb_sg will be updated in-place
  ~ resource "aws_security_group" "ghost_lb_sg" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow communication out to internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0447a1e7379cc641b"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Accept https traffic from the internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "eggs-projects-ghost-blog-sg-alb"
        tags                   = {
            "Name" = "eggs-projects-ghost-blog-alb-sg"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.


```

</details>

*Pushed by: @michaeldeggers, Action: `pull_request`*